package com.maple.leetcode.code200;
/*
给定一个非负整数 num，反复将各个位上的数字相加，直到结果为一位数。
示例:
输入: 38
输出: 2
解释: 各位相加的过程为：3 + 8 = 11, 1 + 1 = 2。
由于 2 是一位数，所以返回 2。
*/

public class LeetCode258 {

    /*

    12345-->1*9999+1 + 2*999+2 + 3*99+3 + 4*9+4 + 5
    -->(1*9999 + 2*999 + 3*99+3 + 4*9) + 1+2+3+4+5
    从12345变成(1+2+3+4+5)相等于12345/9 余(1+2+3+4+5)
    1+2+3+4+5(15)-->9+6, 有相当于(9+6)/9 余6

     */
    public int addDigits(int num) {

        /*if (num == 0) {
            return 0;
        }

        if (num % 9 == 0)
            return 9;

        return num % 9;*/

        return (num - 1) % 9 + 1;
    }
}
